; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared2 - mode
	infrared3 - mode
	spectrograph4 - mode
	infrared1 - mode
	thermograph0 - mode
	GroundStation3 - direction
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument4 infrared1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star1)
	(supports instrument6 infrared3)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument7 thermograph0)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared2)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
)
(:goal (and
	(pointing satellite0 Planet10)
	(have_image Star5 thermograph0)
	(have_image Planet6 infrared3)
	(have_image Star7 thermograph0)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 spectrograph4)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 infrared2)
	(have_image Planet12 infrared3)
))

)

; plan
1. (turn_to satellite2 star0 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star0)
   goals met: 0 of 9
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite2 star5 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star5)
   goals met: 0 of 9
5. (take_image satellite2 star5 instrument3 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 1 of 9
6. (turn_to satellite2 planet8 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 planet8)
   goals met: 1 of 9
7. (take_image satellite2 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 2 of 9
8. (turn_to satellite2 planet10 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet10)
   goals met: 2 of 9
9. (turn_to satellite1 star4 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star4)
   goals met: 2 of 9
10. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 2 of 9
11. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 9
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
13. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 2 of 9
14. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 9
15. (take_image satellite2 planet10 instrument3 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 3 of 9
16. (turn_to satellite0 phenomenon9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 9
17. (take_image satellite0 phenomenon9 instrument0 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 4 of 9
18. (turn_to satellite0 planet12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet12)
   goals met: 4 of 9
19. (take_image satellite0 planet12 instrument0 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 5 of 9
20. (turn_to satellite0 planet6 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet6)
   goals met: 5 of 9
21. (take_image satellite0 planet6 instrument0 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 6 of 9
22. (turn_to satellite0 planet10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet10)
   goals met: 7 of 9
23. (turn_to satellite1 phenomenon11 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon11)
   goals met: 7 of 9
24. (take_image satellite1 phenomenon11 instrument2 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 8 of 9
25. (turn_to satellite2 star7 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star7)
   goals met: 8 of 9
26. (take_image satellite2 star7 instrument3 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 9 of 9
